{
    "meta.title": "Courses LTI Tool",
    "settings.view": "Settings (Courses LTI Tool): View settings",
    "settings.edit": "Settings (Courses LTI Tool): Edit settings",
    "platforms": "LTI Platforms",
    "platform": "LTI Platform",
    "platform.issuer": "Issuer",
    "platform.clientId": "Client ID",
    "platform.clientId.description": "After you register an LTI 1.3 Tool with a Platform/LMS (eg, from within Sakai), the Platform usually generates a Client ID for the Tool. Insert that here. If your LMS allows you to configure the Client ID, enter the same value here that you enter there.",
    "platform.cssUrl": "CSS URL",
    "platform.cssUrl.description": "The tool renders its contents in an iframe, so parent styling is ignored. To style the tool's output, enter the URL of a CSS file here and the iframe will fetch and apply it in a <link>.",
    "platform.jwksUrl": "JWKS URL",
    "platform.jwksUrl.description": "Ujistěte se, že tato adresa URL je veřejně přístupná. Pokud nejsou správně nakonfigurovány, poskytují některé LMS adresy URL, které neberou v úvahu věci jako reverzní proxy.",
    "platform.noReservesMessage": "\"No reserves\" message",
    "platform.noReservesMessage.description": "When a course has no current reserves, this message will be displayed.",
    "platform.oidcAuthUrl": "OIDC authentication URL",
    "platform.oidcAuthUrl.description": "Ujistěte se, že tato adresa URL je veřejně přístupná. Pokud nejsou správně nakonfigurovány, poskytují některé LMS adresy URL, které neberou v úvahu věci jako reverzní proxy.",
    "platform.searchUrl": "Public search URL",
    "platform.searchUrl.description": "<div>Veřejná adresa URL pro vyhledávání se použije pro vytvoření odkazů, pokud není pro vyhrazenou položku definován elektronický přístup. Do URL lze vložit některé proměnné, např. https://find.mylibrary.edu?query=[BARCODE]. Podporované proměnné jsou:</div><ul><li>[BARCODE] - čárový kód položky.</li><li>[INSTANCE_HRID] - HRID instance</li></ul>",
    "errors.issuersMustBeUnique": "Platforma s tímto emitentem již existuje. Emitenti musí být jedineční.",
    "platform.boxDirectDownload": "Transform reserve URLs including \"box.com\" to direct-download using the Box API",
    "platform.boxDirectDownload.description": "Když má položka elektronický přístup a adresa URL obsahuje „box.com“, modul LTI edge může přepsat odkaz tak, aby transparentně nabídl položku ke stažení, místo aby uživatele spojoval s box.com. Pamatujte, že modul edge musí být spuštěn s platným přístupovým tokenem pro rozhraní API Box, další podrobnosti najdete v dokumentaci kurzy modulu edge-lti.",
    "yes": "Ano",
    "no": "No"
}