{
    "meta.title": "Herramienta LTI de Cursos",
    "settings.view": "Configuración (herramienta LTI de  Cursos): Ver configuración",
    "settings.edit": "Configuración (herramienta LTI de  Cursos): Ver configuración",
    "platforms": "Plataformas LTI",
    "platform": "Plataforma LTI",
    "platform.issuer": "Emisor",
    "platform.clientId": "ID de cliente",
    "platform.clientId.description": "Después de registrar una Herramienta LTI 1.3 con una Plataforma/LMS (por ejemplo, desde Sakai), la Plataforma normalmente genera un ID de Cliente para la Herramienta. Introdúzcalo aquí. Si su LMS le permite configurar el ID de cliente, introduzca aquí el mismo valor que introduzca allí.",
    "platform.cssUrl": "URL CSS",
    "platform.cssUrl.description": "La herramienta muestra su contenido en un iframe, por lo que se ignora el estilo de los padres. Para aplicar estilo a la salida de la herramienta, introduzca aquí la URL de un archivo CSS y el iframe lo buscará y lo aplicará en <link>.",
    "platform.jwksUrl": "Agregar URL",
    "platform.jwksUrl.description": "Asegúrese de que esta URL es de acceso público. A menos que estén correctamente configurados, algunos LMS proporcionan una URL que no tiene en cuenta aspectos como los proxies inversos.",
    "platform.noReservesMessage": "Mensaje \"Sin reservas\"",
    "platform.noReservesMessage.description": "Cuando un curso no tenga reservas actuales, aparecerá este mensaje.",
    "platform.oidcAuthUrl": "URL de autenticación OIDC",
    "platform.oidcAuthUrl.description": "Asegúrese de que esta URL es de acceso público. A menos que estén correctamente configurados, algunos LMS proporcionan una URL que no tiene en cuenta aspectos como los proxies inversos.",
    "platform.searchUrl": "URL pública de búsqueda",
    "platform.searchUrl.description": "<div>La URL de búsqueda pública se utilizará para crear enlaces cuando no se haya definido un acceso electrónico para el elemento reservado. Algunas variables pueden insertarse en la URL, por ejemplo, https://find.mylibrary.edu?query=[BARCODE]. Las variables admitidas son:</div><ul><li>[BARCODE] - El código de barras del artículo</li><li>[INSTANCE_HRID] - HRID de la instancia</li></ul>",
    "errors.issuersMustBeUnique": "Ya existe una plataforma con este emisor. Los emisores deben ser únicos.",
    "platform.boxDirectDownload": "Transformar las URL de reserva, incluyendo \"box.com\", a descarga directa usando la API de Box.",
    "platform.boxDirectDownload.description": "Cuando un elemento tiene acceso electrónico y la URL contiene \"box.com\", el módulo de borde de LTI puede reescribir el enlace para que ofrezca de manera transparente el elemento para descargar en lugar de vincular al usuario a box.com. Tenga en cuenta que el módulo de borde debe haberse iniciado con un token de acceso válido para la API de Box; consulte la documentación del módulo de borde-lti-cursos para obtener más detalles.",
    "yes": "Sí",
    "no": "No"
}