{
    "meta.title": "Cours Outil LTI",
    "settings.view": "Paramètres (cours: outil  LTI): afficher les paramètres",
    "settings.edit": "Settings (Courses LTI Tool): Edit settings",
    "platforms": "Plates-formes LTI",
    "platform": "Plateforme LTI",
    "platform.issuer": "Émetteur",
    "platform.clientId": "Identifiant du client",
    "platform.clientId.description": "After you register an LTI 1.3 Tool with a Platform/LMS (eg, from within Sakai), the Platform usually generates a Client ID for the Tool. Insert that here. If your LMS allows you to configure the Client ID, enter the same value here that you enter there.",
    "platform.cssUrl": "URL CSS",
    "platform.cssUrl.description": "The tool renders its contents in an iframe, so parent styling is ignored. To style the tool's output, enter the URL of a CSS file here and the iframe will fetch and apply it in a <link>.",
    "platform.jwksUrl": "URL JWKS",
    "platform.jwksUrl.description": "Assurez-vous que cette URL est accessible au public. À moins qu'ils ne soient correctement configurés, certains LMS fournissent une URL qui ne tient pas compte de certains éléments comme les reverse-proxies.",
    "platform.noReservesMessage": "Pas de réservation (?) - Message",
    "platform.noReservesMessage.description": "Lorsqu'un cours n'a pas actuellement de réservations(?), ce message sera affiché.",
    "platform.oidcAuthUrl": "URL d'authentification OIDC",
    "platform.oidcAuthUrl.description": "Assurez-vous que cette URL est accessible au public. À moins qu'ils ne soient correctement configurés, certains LMS fournissent une URL qui ne tient pas compte de certains éléments comme les reverse-proxies.",
    "platform.searchUrl": "URL de recherche publique",
    "platform.searchUrl.description": "<div>L'URL de recherche publique sera utilisée pour créer des liens lorsque aucun accès électronique n'est défini pour l'exemplaire réservé. Certaines variables peuvent être insérées dans l'URL, par exemple, https://find.mylibrary.edu?query=[BARCODE]. Les variables possibles sont :</div><ul><li>[BARCODE] - le code-barres de l'exemplaire</li><li>[INSTANCE_HRID] - l'HRID de la notice</li></ul>",
    "errors.issuersMustBeUnique": "Une plateforme avec cet émetteur existe déjà. Les émetteurs doivent être uniques.",
    "platform.boxDirectDownload": "Transform reserve URLs including \"box.com\" to direct-download using the Box API",
    "platform.boxDirectDownload.description": "When an item has Electronic Access and the URL contains \"box.com\", the LTI edge module can rewrite the link so that it transparently offers the item for download rather than linking the user to box.com. Note that the edge module must have been launched with a valid Access Token for the Box API, see the documentation for the edge-lti-courses module for more details.",
    "yes": "Oui",
    "no": "Non"
}