{
    "meta.title": "Lessen LTI-tool",
    "settings.view": "Instellingen (Lessen LTI-tool): Instellingen bekijken",
    "settings.edit": "Instellingen (Lessen LTI-tool): Instellingen bewerken",
    "platforms": "LTI-platformen",
    "platform": "LTI-platform",
    "platform.issuer": "Uitgever",
    "platform.clientId": "Klant-ID",
    "platform.clientId.description": "Nadat u een LTI 1.3 tool bij een platform/LMS hebt geregistreerd (bijvoorbeeld vanuit Sakai), genereert het platform meestal een klant-ID voor de tool. Voer die hier in. Als u in uw LMS de klant-ID kunt configureren, vul dan hier dezelfde waarde in als daar.",
    "platform.cssUrl": "CSS-URL",
    "platform.cssUrl.description": "De tool geeft de inhoud weer in een iframe, dus parent styling wordt genegeerd. Om de output van de tool op te maken, voert u hier de URL van een CSS-bestand in en de iframe zal het ophalen en toepassen in een <link>.",
    "platform.jwksUrl": "JWKS-URL",
    "platform.jwksUrl.description": "Zorg ervoor dat deze URL openbaar toegankelijk is. Tenzij ze goed geconfigureerd zijn, bieden sommige LMS'en een URL die geen rekening houdt met zaken zoals reverse proxies.",
    "platform.noReservesMessage": "\"Geen reserveringen\" bericht",
    "platform.noReservesMessage.description": "Als een les geen huidige reserveringen heeft, wordt dit bericht weergegeven.",
    "platform.oidcAuthUrl": "OIDC-authenticatie-URL",
    "platform.oidcAuthUrl.description": "Zorg ervoor dat deze URL openbaar toegankelijk is. Tenzij ze goed geconfigureerd zijn, bieden sommige LMS'en een URL die geen rekening houdt met zaken zoals reverse proxies.",
    "platform.searchUrl": "URL voor openbaar zoeken",
    "platform.searchUrl.description": "<div>De URL voor openbaar zoeken wordt gebruikt voor het maken van links wanneer er geen elektronische toegang is gedefinieerd voor het gereserveerde item. Sommige variabelen kunnen in de URL worden ingevoegd, bijvoorbeeld https://find.mylibrary.edu?query=[BARCODE]. De ondersteunde variabelen zijn:</div><ul><li>[BARCODE] - De barcode van het item</li><li>[INSTANCE_HRID] - De HRID van de instance</li></ul>.",
    "errors.issuersMustBeUnique": "Er bestaat al een platform met deze uitgever. Uitgevers moeten uniek zijn.",
    "platform.boxDirectDownload": "Omzetten van reserverings-URL's inclusief \"box.com\" naar directe download met behulp van de Box API",
    "platform.boxDirectDownload.description": "Wanneer een item digitale toegang heeft en de URL \"box.com\" bevat, kan de LTI-edgemodule de link herschrijven zodat deze transparant het item ter download aanbiedt in plaats van de gebruiker te linken naar box.com. Opmerking: de edgemodule moet gestart zijn met een geldig access token voor de Box API, zie de documentatie voor de edge-lti-coursesmodule voor meer details.",
    "yes": "Ja",
    "no": "Nee"
}