{
    "meta.title": "Courses LTI Tool",
    "settings.view": "Settings (Courses LTI Tool): View settings",
    "settings.edit": "Settings (Courses LTI Tool): Edit settings",
    "platforms": "Платформи LTI",
    "platform": "Платформа LTI",
    "platform.issuer": "Issuer",
    "platform.clientId": "ІД клієнта",
    "platform.clientId.description": "Після реєстрації LTI 1.3 Tool на Платформі/Системі управління навчанням (LMS) (наприклад, Sakai) платформа, як правило, генерує ідентифікатор клієнта для цього інструменту. Вставте його сюди. Якщо ваша LMS дозволяє налаштовувати ідентифікатор клієнта, введіть тут те саме значення, яке ви ввели там.",
    "platform.cssUrl": "CSS URL",
    "platform.cssUrl.description": "The tool renders its contents in an iframe, so parent styling is ignored. To style the tool's output, enter the URL of a CSS file here and the iframe will fetch and apply it in a <link>.",
    "platform.jwksUrl": "JWKS URL",
    "platform.jwksUrl.description": "Ensure that this URL is publicly accessible. Unless they are properly configured, some LMSs provide a URL that doesn't account for things like reverse proxies.",
    "platform.noReservesMessage": "\"No reserves\" message",
    "platform.noReservesMessage.description": "When a course has no current reserves, this message will be displayed.",
    "platform.oidcAuthUrl": "OIDC authentication URL",
    "platform.oidcAuthUrl.description": "Ensure that this URL is publicly accessible. Unless they are properly configured, some LMSs provide a URL that doesn't account for things like reverse proxies.",
    "platform.searchUrl": "URL-адреса загальнодоступного пошуку",
    "platform.searchUrl.description": "<div>Загальнодоступна URL-адреса для пошуку буде використовуватися для створення посилань, у тих випадках коли для заброньованого примірника не визначений електронний доступ. В URL-адресу, можна додати деякі змінні, наприклад, https://find.mylibrary.edu?query=[BARCODE]. Підтримувані змінні:</div><ul><li>[BARCODE]] - штрихкод примірника</li><li>[INSTANCE_HRID] - HRID біб.запису (інстансу)</li></ul>",
    "errors.issuersMustBeUnique": "A platform with this issuer already exists. Issuers must be unique.",
    "platform.boxDirectDownload": "Перетворення резервних URL-адрес, включно з \"box.com\", на пряме завантаження за допомогою Box API",
    "platform.boxDirectDownload.description": "Якщо елемент має електронний доступ і URL-адреса містить \"box.com\", модуль LTI edge може переписати посилання так, щоб воно прозоро пропонувало цей елемент для завантаження, а не перенаправляло користувача на box.com. Зверніть увагу, що LTI edge модуль повинен бути запущений з дійсним токеном доступу для Box API, докладніше див. документацію до модуля edge-lti-courses.",
    "yes": "Так",
    "no": "Ні"
}